Repository: Croesus0303/Zink
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTagline
source: AI-Powered Photo Challenges
tr: AI Destekli Fotoğraf Yarışmaları

source: Continue with Google
tr: Google ile Devam Et

source: Sign in or Sign up
tr: Giriş Yap veya Kaydol

# newUserPrompt
source: New to Zink? Sign up with your Google account
tr: Zink'te yeni misin? Google hesabınla kaydol

# existingUserPrompt
source: Already have an account? Sign in to continue
tr: Zaten hesabın var mı? Devam etmek için giriş yap

source: Continue with Apple
tr: Apple ile Devam Et

source: Sign Out
tr: Çıkış Yap

# signOutConfirmation
source: Are you sure you want to sign out?
tr: Çıkış yapmak istediğinden emin misin?

# welcome
source: Welcome {name}!
tr: Hoş geldin {name}!

source: Home
tr: Ana Sayfa

# noActiveChallenges
source: No active challenges right now
tr: Şu anda aktif yarışma yok

source: Active Challenge
tr: Aktif Yarışma

source: Past Challenges
tr: Geçmiş Yarışmalar

# timeRemaining
source: Time Remaining: {time}
tr: Kalan Süre: {time}

source: Submit Photo
tr: Fotoğraf Gönder

source: Take Photo
tr: Fotoğraf Çek

source: Choose from Gallery
tr: Galeriden Seç

source: Submissions
tr: Gönderiler

# likes
source: {count, plural, =0{No likes} =1{1 like} other{{count} likes}}
tr: {count} beğeni

# commentCount
source: {count, plural, =0{No comments} =1{1 comment} other{{count} comments}}
tr: {count} yorum

source: Comments
tr: Yorumlar

# addComment
source: Add a comment...
tr: Yorum ekle...

source: Profile
tr: Profil

source: Edit Profile
tr: Profili Düzenle

source: Username
tr: Kullanıcı Adı

source: Social Links
tr: Sosyal Medya Bağlantıları

source: My Challenges
tr: Yarışmalarım

# totalSubmissions
source: {count} Submissions
tr: {count} Gönderi

source: Most Popular
tr: En Popüler

source: Newest
tr: En Yeni

source: Oldest
tr: En Eski

source: Loading...
tr: Yükleniyor...

source: Error
tr: Hata

source: Retry
tr: Tekrar Dene

source: Cancel
tr: İptal

source: Save
tr: Kaydet

source: Delete
tr: Sil

source: Confirm
tr: Onayla

source: Something went wrong
tr: Bir şeyler ters gitti

source: New challenge available!
tr: Yeni yarışma mevcut!

source: Challenge ending soon!
tr: Yarışma yakında bitiyor!

# submissionSuccessful
source: Photo submitted successfully!
tr: Fotoğraf başarıyla gönderildi!

source: Submit
tr: Gönder

source: Welcome to Zink!
tr: Zink'e Hoş Geldin!

# onboardingSubtitle
source: Let's set up your profile to get started
tr: Başlamak için profilini ayarlayalım

# chooseUsername
source: Choose a username
tr: Kullanıcı adı seç

# enterUsername
source: Enter your username
tr: Kullanıcı adını gir

source: What's your age?
tr: Yaşın kaç?

# enterAge
source: Enter your age
tr: Yaşını gir

source: Complete Setup
tr: Kurulumu Tamamla

# usernameRequired
source: Username is required
tr: Kullanıcı adı gerekli

# usernameTooShort
source: Username must be at least 3 characters
tr: Kullanıcı adı en az 3 karakter olmalı

# usernameTooLong
source: Username must be less than 20 characters
tr: Kullanıcı adı 20 karakterden az olmalı

# usernameInvalidChars
source: Username can only contain letters, numbers, and underscores
tr: Kullanıcı adı sadece harf, rakam ve alt çizgi içerebilir

# ageRequired
source: Age is required
tr: Yaş gerekli

# enterValidNumber
source: Please enter a valid number
tr: Lütfen geçerli bir sayı girin

# ageTooYoung
source: You must be at least 13 years old
tr: En az 13 yaşında olmalısınız

# enterValidAge
source: Please enter a valid age
tr: Lütfen geçerli bir yaş girin

# privacyNote
source: By continuing, you agree to our Terms of Service and Privacy Policy. Your information is secure and will only be used to enhance your experience.
tr: Devam ederek Hizmet Şartlarımızı ve Gizlilik Politikamızı kabul etmiş olursunuz.

source: Profile Picture
tr: Profil Fotoğrafı

source: Change Profile Picture
tr: Profil Fotoğrafını Değiştir

source: Display Name
tr: Görünen Ad

source: Basic Information
tr: Temel Bilgiler

source: Social Media Links
tr: Sosyal Medya Bağlantıları

source: Website
tr: Web Sitesi

source: Settings
tr: Ayarlar

source: Email
tr: E-posta

# enterEmail
source: Enter your email
tr: E-postanızı girin

source: Password
tr: Şifre

# enterPassword
source: Enter your password
tr: Şifrenizi girin

source: Confirm Password
tr: Şifreyi Onayla

# reenterPassword
source: Re-enter your password
tr: Şifrenizi tekrar girin

# pleaseEnterEmail
source: Please enter your email
tr: Lütfen e-postanızı girin

# pleaseEnterValidEmail
source: Please enter a valid email
tr: Lütfen geçerli bir e-posta girin

# pleaseEnterPassword
source: Please enter your password
tr: Lütfen şifrenizi girin

# passwordTooShort
source: Password must be at least 6 characters
tr: Şifre en az 6 karakter olmalı

# pleaseConfirmPassword
source: Please confirm your password
tr: Lütfen şifrenizi onaylayın

source: Passwords do not match
tr: Şifreler eşleşmiyor

source: App
tr: Uygulama

source: About
tr: Hakkında

# version
source: Version {version}
tr: Sürüm {version}

source: Privacy Policy
tr: Gizlilik Politikası

# helpAndSupport
source: Help & Support
tr: Yardım ve Destek

source: Delete Account
tr: Hesabı Sil

# permanentlyDeleteAccount
source: Permanently delete your account and all data
tr: Hesabınızı ve tüm verilerinizi kalıcı olarak silin

source: Close
tr: Kapat

# socialPhotoSharingApp
source: A social photo sharing app for events and moments.
tr: Etkinlikler ve anlar için sosyal fotoğraf paylaşım uygulaması.

source: Zink Privacy Policy
tr: Zink Gizlilik Politikası

# lastUpdated
source: Last updated: {year}
tr: Son güncelleme: {year}

source: Information We Collect
tr: Topladığımız Bilgiler

# howWeUseInformation
source: How We Use Your Information
tr: Bilgilerinizi Nasıl Kullanırız

source: Information Sharing
tr: Bilgi Paylaşımı

source: Data Security
tr: Veri Güvenliği

source: Your Rights
tr: Haklarınız

source: Contact Us
tr: Bize Ulaşın

source: Frequently Asked Questions
tr: Sık Sorulan Sorular

# howCreateAccount
source: How do I create an account? Tap the sign up button and follow the prompts to create your account.
tr: Nasıl hesap oluştururum? Kaydol butonuna dokunun ve yönergeleri takip edin.

# howPostPhoto
source: How do I post a photo? Tap the camera icon in the events section and select an active event.
tr: Nasıl fotoğraf paylaşırım? Etkinlikler bölümündeki kamera simgesine dokunun.

# howLikeSubmission
source: How do I like a submission? Tap the heart icon below any photo submission.
tr: Bir gönderiyi nasıl beğenirim? Kalp simgesine dokunun.

# howEditProfile
source: How do I edit my profile? Go to Profile > Menu > Edit Profile.
tr: Profilimi nasıl düzenlerim? Profil > Menü > Profili Düzenle'ye gidin.

source: Contact Support
tr: Destek ile İletişim

# emailSupport
source: Email: support@zinkapp.com
tr: E-posta: support@zinkapp.com

# responseTime
source: Response time: 24-48 hours
tr: Yanıt süresi: 24-48 saat

# urgentIssuesNote
source: For urgent issues, please include "URGENT" in your subject line.
tr: Acil durumlar için konu satırına "ACİL" yazın.

source: App Version
tr: Uygulama Sürümü

# platformMobile
source: Platform: Mobile App
tr: Platform: Mobil Uygulama

# reportBug
source: Report a Bug
tr: Hata Bildir

# bugReportInstructions
source: If you encounter any issues, please describe: • What you were doing when the problem occurred • Steps to reproduce the issue • Your device model and OS version
tr: Sorun yaşarsanız lütfen açıklayın: • Ne yaptığınızda sorun oluştu • Sorunu tekrarlama adımları • Cihaz ve işletim sistemi bilgisi

# actionCannotBeUndone
source: This action cannot be undone. This will permanently delete your account and all associated data.
tr: Bu işlem geri alınamaz. Hesabınızı kalıcı olarak silecektir.

# enterPasswordToConfirm
source: Please enter your password to confirm:
tr: Onaylamak için şifrenizi girin:

# passwordRequired
source: Password is required
tr: Şifre gerekli

source: Account deleted successfully
tr: Hesap başarıyla silindi

# incorrectPassword
source: Incorrect password. Please try again.
tr: Yanlış şifre. Tekrar deneyin.

# tooManyFailedAttempts
source: Too many failed attempts. Please try again later.
tr: Çok fazla başarısız deneme. Daha sonra tekrar deneyin.

# failedToDeleteAccount
source: Failed to delete account. Please try again.
tr: Hesap silinemedi. Tekrar deneyin.

source: Final Confirmation
tr: Son Onay

# absolutelySureWarning
source: Are you absolutely sure? This action cannot be undone and will permanently delete: • Your profile and account data • All your posts and submissions • Your chat history • All other associated data This action is irreversible.
tr: Kesinlikle emin misiniz? Bu işlem geri alınamaz.

source: Yes, Delete My Account
tr: Evet, Hesabımı Sil

source: Event Not Found
tr: Etkinlik Bulunamadı

source: Error loading event
tr: Etkinlik yüklenirken hata oluştu

source: Go Back
tr: Geri Dön

source: Submission Limit Reached
tr: Gönderi Limitine Ulaşıldı

# usedAllSubmissions
source: You have used all your submissions for this event.
tr: Bu etkinlik için tüm gönderilerinizi kullandınız.

source: Challenge
tr: Yarışma

source: Ending soon
tr: Yakında bitiyor

source: Your Photo
tr: Fotoğrafın

source: Add your photo
tr: Fotoğrafını ekle

source: Submission Guidelines
tr: Gönderi Kuralları

# matchChallengeTheme
source: Make sure your photo matches the challenge theme
tr: Fotoğrafınızın yarışma temasına uygun olduğundan emin olun

# useGoodLighting
source: Use good lighting and clear focus
tr: İyi aydınlatma ve net odak kullanın

# originalPhotosOnly
source: Original photos only - no screenshots or downloaded images
tr: Sadece orijinal fotoğraflar kabul edilir

# cameraPermissionDenied
source: Camera permission is required to take photos
tr: Fotoğraf çekmek için kamera izni gereklidir

# photoLibraryPermissionDenied
source: Photo library permission is required to select photos
tr: Fotoğraf seçmek için fotoğraf kitaplığı izni gereklidir

# failedToTakePhoto
source: Failed to take photo: {error}
tr: Fotoğraf çekilemedi: {error}

# failedToSelectPhoto
source: Failed to select photo: {error}
tr: Fotoğraf seçilemedi: {error}

# pleaseSelectPhotoFirst
source: Please select a photo first
tr: Lütfen önce bir fotoğraf seçin

source: User not authenticated
tr: Kullanıcı doğrulanmadı

# failedToSubmitPhoto
source: Failed to submit photo: {error}
tr: Fotoğraf gönderilemedi: {error}

source: Submitting...
tr: Gönderiliyor...

source: Error loading submission data
tr: Gönderi verileri yüklenirken hata oluştu

source: Authentication Required
tr: Doğrulama Gerekli

# pleaseSignInToSubmit
source: Please sign in to submit photos
tr: Fotoğraf göndermek için giriş yapın

source: Submission Not Found
tr: Gönderi Bulunamadı

source: Error loading submission
tr: Gönderi yüklenirken hata oluştu

source: Photo
tr: Fotoğraf

source: Delete Post
tr: Gönderiyi Sil

# sureDeletePost
source: Are you sure you want to delete this post? This action cannot be undone.
tr: Bu gönderiyi silmek istediğinizden emin misiniz?

source: Post deleted successfully
tr: Gönderi başarıyla silindi

source: Failed to delete post
tr: Gönderi silinemedi

source: Messages
tr: Mesajlar

source: Error loading chats
tr: Sohbetler yüklenirken hata oluştu

source: No conversations yet
tr: Henüz konuşma yok

source: Unknown User
tr: Bilinmeyen Kullanıcı

source: No messages yet
tr: Henüz mesaj yok

source: Failed to load user data
tr: Kullanıcı verileri yüklenemedi

source: Chat deleted
tr: Sohbet silindi

source: Delete Chat
tr: Sohbeti Sil

source: Just now
tr: Az önce

source: User
tr: Kullanıcı

source: Error loading messages
tr: Mesajlar yüklenirken hata oluştu

# typeMessage
source: Type a message...
tr: Mesaj yazın...

source: User not found
tr: Kullanıcı bulunamadı

# pageNotFound
source: Page not found: {location}
tr: Sayfa bulunamadı: {location}

source: Go Home
tr: Ana Sayfaya Git

source: No submissions yet
tr: Henüz gönderi yok

# beFirstToSubmit
source: Be the first to submit a photo!
tr: Fotoğraf gönderen ilk kişi ol!

source: Error loading submissions
tr: Gönderiler yüklenirken hata oluştu

source: Anonymous Winner
tr: Anonim Kazanan

# championOfEvent
source: Champion of this event!
tr: Bu etkinliğin şampiyonu!

source: Storage Test
tr: Depolama Testi

source: Test Storage Connection
tr: Depolama Bağlantısını Test Et

# pickImageAndUpload
source: Pick Image & Upload
tr: Resim Seç ve Yükle

source: Selected Image:
tr: Seçilen Resim:

# accountExistsWithDifferentCredential
source: An account already exists with a different credential.
tr: Farklı kimlik bilgileriyle bir hesap mevcut.

# credentialMalformedOrExpired
source: The credential received is malformed or has expired.
tr: Kimlik bilgisi hatalı veya süresi dolmuş.

# operationNotAllowed
source: This operation is not allowed. Please contact support.
tr: Bu işleme izin verilmiyor.

# userAccountDisabled
source: This user account has been disabled.
tr: Kullanıcı hesabı devre dışı bırakılmış.

# noUserFoundWithEmail
source: No user found with this email address.
tr: Bu e-posta adresine sahip kullanıcı bulunamadı.

# incorrectPasswordTryAgain
source: Incorrect password. Please try again.
tr: Yanlış şifre. Tekrar deneyin.

# tooManyRequestsTryLater
source: Too many requests. Try again later.
tr: Çok fazla istek. Daha sonra tekrar deneyin.

# networkErrorCheckConnection
source: Network error. Please check your connection.
tr: Ağ hatası. Bağlantınızı kontrol edin.

# emailAlreadyRegistered
source: This email address is already registered. Please sign in instead.
tr: Bu e-posta adresi zaten kayıtlı.

# enterValidEmailAddress
source: Please enter a valid email address.
tr: Geçerli bir e-posta adresi girin.

# passwordTooWeak
source: Password is too weak. Please choose a stronger password.
tr: Şifre çok zayıf. Daha güçlü bir şifre seçin.

# signOutAndSignInAgain
source: Please sign out and sign in again before retrying this request.
tr: Çıkış yapın ve tekrar giriş yapın.

# verificationCodeInvalid
source: The verification code is invalid. Please try again.
tr: Doğrulama kodu geçersiz.

# verificationIdInvalid
source: The verification ID is invalid. Please try again.
tr: Doğrulama kimliği geçersiz.

# authenticationFailedTryAgain
source: Authentication failed. Please try again.
tr: Kimlik doğrulama başarısız. Tekrar deneyin.

# failedToLoadChat
source: Failed to load chat: {error}
tr: Sohbet yüklenemedi: {error}

# failedToSendMessage
source: Failed to send message: {error}
tr: Mesaj gönderilemedi: {error}

# noConversationsDescription
source: Start a conversation by visiting someone's profile
tr: Birinin profilini ziyaret ederek konuşma başlatın

# startConversation
source: Start the conversation!
tr: Konuşmayı başlat!

# failedToDeleteChat
source: Failed to delete chat: {error}
tr: Sohbet silinemedi: {error}

# sureDeleteChat
source: Are you sure you want to delete this chat? This action cannot be undone.
tr: Bu sohbeti silmek istediğinizden emin misiniz?

# yesterdayAt
source: Yesterday {time}
tr: Dün {time}

source: Yesterday
tr: Dün

# daysAgo
source: {days} days ago
tr: {days} gün önce

# hoursLeft
source: {hours}h {minutes}m left
tr: {hours}sa {minutes}dk kaldı

# minutesLeft
source: {minutes}m left
tr: {minutes}dk kaldı

source: Active
tr: Aktif

source: Ended
tr: Bitti

# minutesAgo
source: {minutes}m ago
tr: {minutes}dk önce

# hoursAgo
source: {hours}h ago
tr: {hours}sa önce

# daysAgoShort
source: {days}d ago
tr: {days}g önce

# profileNotSetUp
source: Profile not set up yet
tr: Profil henüz ayarlanmadı

# pleaseCompleteProfileSetup
source: Please complete your profile setup
tr: Lütfen profil kurulumunuzu tamamlayın

# errorLoadingProfile
source: Error loading profile: {error}
tr: Profil yüklenirken hata oluştu: {error}

source: SPOTLIGHT
tr: SPOT IŞIĞI

source: Past Tasks
tr: Geçmiş Görevler

# noActiveTasksRight
source: No active tasks right now
tr: Şu anda aktif görev yok

source: Tasks loading...
tr: Görevler yükleniyor...

# errorLoadingTasks
source: Error occurred while loading tasks
tr: Görevler yüklenirken hata oluştu

source: No past tasks yet
tr: Henüz geçmiş görev yok

# notificationPermissionMessage
source: Allow permission to receive notifications about new tasks and updates.
tr: Yeni görevler ve güncellemeler hakkında bildirim almak için izin verin.

source: Not Now
tr: Şimdi Değil

source: Allow Permission
tr: İzin Ver

source: Notifications
tr: Bildirimler

source: Notification permission granted!
tr: Bildirim izni verildi!

# notificationPermissionDenied
source: Notification permission denied. You can grant permission from settings.
tr: Bildirim izni reddedildi.

source: Today
tr: Bugün

# daysLeft
source: {days}d left
tr: {days}g kaldı

# daysAndHoursLeft
source: {days}d {hours}h left
tr: {days}g {hours}sa kaldı

source: No notifications yet
tr: Henüz bildirim yok

# notificationsWillAppearHere
source: You'll receive notifications about likes and comments here
tr: Beğeniler ve yorumlar hakkında bildirimleri burada alacaksınız

source: Error loading notifications
tr: Bildirimler yüklenirken hata oluştu

source: All notifications marked as read
tr: Tüm bildirimler okundu olarak işaretlendi

source: Failed to mark notifications as read
tr: Bildirimler okundu olarak işaretlenemedi

source: Failed to delete notification
tr: Bildirim silinemedi

# minutesAgoShort
source: {minutes}m ago
tr: {minutes}dk önce

# hoursAgoShort
source: {hours}h ago
tr: {hours}sa önce

# weeksAgoShort
source: {weeks}w ago
tr: {weeks}h önce

source: Timeline
tr: Zaman Tüneli

source: Events
tr: Etkinlikler

source: No posts yet
tr: Henüz gönderi yok

# checkBackLater
source: Check back later for new posts
tr: Yeni gönderiler için daha sonra tekrar kontrol edin

source: Error loading timeline
tr: Zaman tüneli yüklenirken hata oluştu

source: Unknown
tr: Bilinmeyen
